TestCase/WSDS81_B22_U05/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     surfactantInterFoam; 

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.002;

deltaT          1e-12;

writeControl    adjustable;

writeInterval   0.00001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.01;
maxAlphaCo      0.01;
maxSigmaCo		1;
maxSorptionCo	0.1;

maxDeltaT       0.000005;

LSConvLoopMax	100;
LSConvLoopRelPsiTol      0.1; 
LSConvLoopGradPsiTol     5e-2;

errLinkInf			2e-8;//1e-9;
saaConvLoopMax      10;
saaConvLoopTol      1e-5; 

meshDim	(1 1 0);

// ************************************************************************* //