TestCase/WSDS81_B22_U05/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    Wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       19000;
    }
    Atmosphere
    {
        type            patch;
        nFaces          200;
        startFace       19120;
    }
    frontAndBackPlanes_pos
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          9600;
        startFace       19320;
    }
    frontAndBackPlanes_neg
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          9600;
        startFace       28920;
    }
    center
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       38520;
    }
)

// ************************************************************************* //
