TestCase/WSDS81_B22_U05/0/orig/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Wall
    {
        type			noSlip;

    }
    Atmosphere
    {
        //type            pressureInletOutletVelocity;
		//value           uniform (0 0 0);
		type            zeroGradient;    
    }

	frontAndBackPlanes_pos
    {
        type            wedge;
    }
    frontAndBackPlanes_neg
    {
        type            wedge;
    }
	center
    {
        type            empty;
    }
}


// ************************************************************************* //
