TestCase/WSDS81_B22_U05/0/orig/alpha.water.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Wall
    {
		type			saaDynamicKistlerAlphaContactAngle;
		thetaA			90;
		thetaR			90;
		muEffKistler    muEffKistler;
		sigmaKistler	sigmaKistler;
		limit           gradient;
		value           uniform 0;
    }
	
    Atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

	frontAndBackPlanes_pos
    {
        type            wedge;
    }
    frontAndBackPlanes_neg
    {
        type            wedge;
    }
	center
    {
        type            empty;
    }
}

// ************************************************************************* //
